import React from 'react';

import {Container, Row, Col} from 'mdbreact';

class MainText extends React.Component{
    render(){
        return(
            <div>
            <div id="lg">
                <Container>
                    <h4>Попередник колективу</h4>
                    <Row>
                        <Col>
                            <p>
                                Клуб, який має сучасну назву ФК “КіПіШ“ є продовженням традицій міні-футбольного клубу “Легіон“, який було створено у 2007 році однодумцями-друзями, які жили всі поруч на вулиці Київській.
                            </p>
                            <p>
                                Свою першу гру команда провела на Кубку міста Вінниці з міні-футболу, який відбувався на території Вінницького медичного коледжу.
                            </p>
                            <p>
                                Найстаршому гравцю команди на той час було 14 років! Сліпий жереб звів ще зовсім юну команду “Легіон“ з колективом “Юніор“, в якій грали спортсмени на 3-4 роки старші.
                            </p>
                            <p>    
                                Нажаль, перша спроба виходу на рівень міських змагань був невдалий і наш колектив зазнав розгромної поразки 4-0.
                            </p>
                            <p>
                                Склад МФК “Легіон“ (2007 рік):
                                <ul>
                                    <li>Голубєв Олексій (воротар)</li>
                                    <li>Крещенко Ігор (захисник)</li>
                                    <li>Константинов Євгеній (захисник)</li>
                                    <li>Калієв Сергій (півзахисник)</li>
                                    <li>Іваньков Денис (півзахисник)</li>
                                    <li>Мельник Олексій (півзахисник)</li>
                                    <li>ПетровРоман (нападаючий)</li>    
                                </ul>
                            </p>
                            <p>
                                Наступний, після участі у офіційних змаганнях рік пройшов без участі у турнірах. Колектив проводив тренування на території ЗОШ №5 та ЗОШ №31. Взимку 2008 року, в зв’язку з відсутністю місця для проведення тренувань, колектив взяв в оренду зал ЗОШ №31 де і проводив свої тренування.
                            </p>
                            <p>
                                Саме в цей час і відбулось знайомство з майбутнім гравцем команди Валерієм Калиною. В кінці літа 2009 функціонерами команди було помічено оголошення про проведення “Кубку Вінницького району“, який організовувала обласна федерація футболу. Було прийнято рішення прийняти участь у турнірі під назвою ФК “Вінниця“.
                            </p>
                            <p>
                                Саме на цей турнір у команди з’явилась перша футбольна екіпіровка - форма. Першою формою команди Легіон- КіПіШ стала “динамівська” форма зразка початку 2000-х.
                            </p>
                        </Col>
                    </Row>
                    
                </Container>
            </div>
            
            <div id="dg">
                <Container>
                <h4>Команда одного матчу</h4>
                    <Row>
                        <Col>
                        <p>
                            Даний турнір був єдиим в якому команді довелось зіграти під назвою ФК “Вінниця“.
                        </p>
                        <p>
                            До турніру на велике поле команда готувалася на стадіоні “Темп“, який розташований в мікрорайоні ГПЗ. Це поле було обране, оскільки було найзручнішим в плані логістики.
                        </p>
                        <p>
                            Сліпий жереб звів колектив з флагманом обласного футболу тих часів, командою “О.Л.Кар“ з Шаргороду.
                        </p>
                        <p>
                            31 серпня 2009 року, на стадіоні “Палацу дітей та юнацтва міста”, відбувся матч 1/8 Кубку району з футболу. Наш колектив ФК “Вінниця“ грав проти шаргородського “О.Л.Кара“ та зазнав прикрої поразки 0-2. Але маючи купу не реалізованих моментів, колектив був відзначений організаторами та запрошений на участь у інших турнірах рівня області та міста
                        </p>

                        </Col>
                    </Row>
                </Container>
            </div>

            <div id="lg">
                <Container>
                <h4>Повернення Легіону</h4>
                    <Row>
                        <Col>
                        <p>
                            2010 футбольний рік колектив розпочав тренуваннями в ЗОШ №31. Доречі саме на одному з тренувань, наприкінці весни 2010 року колектив познайомився з іще одним своїм екс-гравцем - Олександром Поповським.
                        </p>
                        <p>
                            Перші офіційні матчі у 2010 році відбулись на початку червня, на СК “Ниві“. Саме там відбувався Кубок Ниви. На даних змаганнях наш колектив зміг обіграти команду МФК “П’ятничани“ з рахунком 6-3, а в 1/4 фіналу “Легіон“ поступився колективу з назвою “Інспектор“.
                        </p>
                        <p>
                            В кінці літа 2010 команду занесло на турнір під егідою Партії регіонів, який був присвячений Дню Незалежності України.
                        </p>
                        <p>
                            За жеребом ми потрапили на коману “Масив“, в якій грали відомі на все місто гравці професійних ФК, такі як Веретинський, Трапля. Турнір проходив на чи не єдиному на той час штучному газоні у місті - стадіоні ЦПКіВ. “Легіон” зазнав поразки, але, нажаль, результат не залишився в історії.
                        </p>
                        <p>
                            Починаючи з кінця осені 2010 та взимку 2011 колектив розпочав постійні тренування в залі СК “Нива“. Кожну пятницю проводився міні-турнір з трьох команд.
                        </p>
                        <p>
                            Літо 2011 пройшло за стандартною схемою - стадіон ЗШ №31 та стадіон ЗШ №5. Були спроби потрапити на міські змагання, але нажаль ми чи не знали про них, чи запізно подавали заявку...
                        </p>
                        <p>
                            Але був і позитив у 2011 році! Частина команди змогла пробитись у склад команди ФК “Спас“, яка на той час приймала участь у Всеукраїнських змаганнях, та змогла досягти фіналу. Олексій Голубєв, був на матчі в столиці - Києва, як резервний кіпер. Ігор Крещенко приїхав підтримати команду. Окрім того у складі команди “Спас” грали майбутні гравці “КіПіШа” - Валерій Калина, екс-гравець Олександр Поповський та Дмитро Маринович. Фінал у Києві запам’ятався для п’ятірки футболістів на довго, а дорогу додому напевно не зможе забути ніхто з присутніх=)
                        </p>

                        </Col>
                    </Row>
                </Container>
            </div>

            <div id="dg">
                <Container>
                <h4>“КіПіШ” - народження легенди!</h4>
                    <Row>
                        <Col>
                        <p>Саме восени 2011 року, вперше команда з назвою “КіПіШ“ з’явилась на футбольній мапі міста Вінниця.</p>
                        <p>Сама назва команди була придумана для участі у квестах та грі “Що? Де? Коли?“. КіПіШ - це абревіатура: “Клуб імені пива і шашлика“.</p>
                        <p>Першим турніром для колективу став зимовий Кубок Ниви, який проходив на одноіменній базі.</p>
                        <p>КіПіШ зразка осені 2011 на турнірі потрапив у групу до віце- чемпіона міста “ЕМС-Поділля”, міцного середняка чемпіонату міста - “Дом Кофе” та чемпіона першості області - “Колоса“.</p>
                        <p>Незважаючи на останнє місце в групі колектив отримав головне - задоволення від гри... Ну і два вибитих пальці для кіпера - Олексія Голубєва.</p>
                        <p>
                            Склад ФК “КіПіШ“ зразка осінь 2011:
                            <ul>
                                <li>Голубєв Олексій</li>
                                <li>Крещенко Ігор</li>
                                <li>Окрема Іван</li>
                                <li>Терлецький Тарас</li>
                                <li>Павленко Тарас</li>
                                <li>Дорофєєв Михайло</li>
                                <li>Шемчишен Владислав</li>
                                <li>Єлістратов Максим</li>
                            </ul>
                        </p>
                        </Col>
                    </Row>
                </Container>
            </div>


            </div>
        );
    }
}

export default MainText;